Revit 2024 API
IExternalDBApplication.OnShutdown Method
Implement this method to execute some tasks when Autodesk Revit shuts down.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
ExternalDBApplicationResult OnShutdown(
	ControlledApplication application
)
Visual Basic
Function OnShutdown ( _
	application As ControlledApplication _
) As ExternalDBApplicationResult
Visual C++
ExternalDBApplicationResult OnShutdown(
	ControlledApplication^ application
)
Parameters
application
Type: Autodesk.Revit.ApplicationServices.ControlledApplication
 Handle to the Revit Application object.
Return Value
Indicates if the external db application completes its work successfully.
See Also
IExternalDBApplication Interface
Autodesk.Revit.DB Namespace